src/DataProcessors/РабочееМестоБуфер/РабочееМестоБуфер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоБуфер</name>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Стенд</name>
    <attributes>
      <name>ПроизводственноеЗадание</name>
      <type>
        <types>DocumentRef.ПроизводственноеЗадание</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>БарКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>17</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодDanfoss</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стенд</name>
      <type>
        <types>CatalogRef.Стенды</types>
      </type>
    </attributes>
    <attributes>
      <name>Прогон</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НапряжениеНаСтенде</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПроверки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПроверки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроверкаОкончена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>ЭтапСпецификации</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Позиция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыЭлементовНормРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
        <types>CatalogRef.Документация</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ТехОперации</types>
        <types>CatalogRef.Материалы</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСправочника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>21</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/НапряжениеБатарейки/НапряжениеБатарейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НапряжениеБатарейки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>НапряжениеНаСтенде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НапряжениеПослеБуфера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/РабочееМестоБуфер/Forms/ПроверкаНапряжения/Module.bsl
&НаКлиенте
Процедура ОК(Команда)
	Если флРемонт Тогда
	Закрыть(0);
	Иначе
	Закрыть(1);	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
Закрыть(-1);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ПЗ = Параметры.ПЗ;
НапряжениеПослеБуфера = Параметры.НапряжениеПослеБуфера;
НаборЗаписей = РегистрыСведений.НапряжениеБатарейки.СоздатьНаборЗаписей();
НаборЗаписей.Отбор.ПЗ.Установить(ПЗ);
НаборЗаписей.Прочитать();
    Для Каждого Запись Из НаборЗаписей Цикл 
  	НапряжениеНаСтенде = Запись.НапряжениеНаСтенде;
    ДатаНапряжениеНаСтенде = Запись.Период;
    КонецЦикла; 
РазницаНапряжений = НапряжениеНаСтенде - НапряжениеПослеБуфера;
КолДней = Окр((ТекущаяДата() - ДатаНапряжениеНаСтенде)/86400,0,1);
	Если КолДней < 6 Тогда
	МинимальноеНапряжение = 3.1;
		Если НапряжениеПослеБуфера >= МинимальноеНапряжение Тогда
		Ограничение = 0.1;
			Если РазницаНапряжений > Ограничение Тогда
			Элементы.Результат.Заголовок = "Падение напряжения на батарейке больше "+Ограничение+" В! Отправляем в ремонт!";
			Элементы.Результат.ЦветТекста = Новый Цвет(255,0,0);
			флРемонт = Истина;
			Иначе
			Элементы.Результат.Заголовок = "Батарейка пригодна для использования! Передаём на упаковку!";
			КонецЕсли;
		Иначе
		Элементы.Результат.Заголовок = "Напряжение батарейки меньше "+МинимальноеНапряжение+" В! Отправляем в ремонт!";
		Элементы.Результат.ЦветТекста = Новый Цвет(255,0,0);
		флРемонт = Истина;
		КонецЕсли;
	ИначеЕсли (КолДней >= 6)и(КолДней <= 15) Тогда
	МинимальноеНапряжение = 3.10-0.01*(КолДней-5);
		Если НапряжениеПослеБуфера >= МинимальноеНапряжение Тогда
		Ограничение = 0.1+0.01*(КолДней-5);
			Если РазницаНапряжений > Ограничение Тогда
			Элементы.Результат.Заголовок = "Падение напряжения на батарейке больше "+Ограничение+" В! Отправляем в ремонт!";
			Элементы.Результат.ЦветТекста = Новый Цвет(255,0,0);
			флРемонт = Истина;
			Иначе
			Элементы.Результат.Заголовок = "Батарейка пригодна для использования! Передаём на упаковку!";
			КонецЕсли;
		Иначе
		Элементы.Результат.Заголовок = "Напряжение батарейки меньше "+МинимальноеНапряжение+" В! Отправляем в ремонт!";
		Элементы.Результат.ЦветТекста = Новый Цвет(255,0,0);
		флРемонт = Истина;
		КонецЕсли;
	Иначе
	МинимальноеНапряжение = 3.0;
		Если НапряжениеПослеБуфера >= МинимальноеНапряжение Тогда
		Элементы.Результат.Заголовок = "Батарейка пригодна для использования! Передаём на упаковку!";
		Иначе
		Элементы.Результат.Заголовок = "Напряжение батарейки меньше "+МинимальноеНапряжение+" В! Отправляем в ремонт!";
		Элементы.Результат.ЦветТекста = Новый Цвет(255,0,0);
		флРемонт = Истина;
		КонецЕсли;
    КонецЕсли;
КонецПроцедуры
